# SetOpacityByClass

## Description
Sets the specified class to use the class opacity.

```pascal
PROCEDURE SetOpacityByClass(h : HANDLE);
```

```python

def vs.SetOpacityByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||

## Version
Availability: from VectorWorks 2008
## Category
* Object Attributes